
<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/StijnZanders/limber/runs/run-7Y9EQLpd1qWLSqfu

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

google_storage_bucket_object.task_test_task2: Refreshing state... [id=stijnzanders-serverless-etl-bucket-test_dag/test_task2_81fe29cfb4f6280c32e01022fa7a09aa.zip]
google_secret_manager_secret.TEST_CLIENT_ID: Refreshing state... [id=projects/serverless-etl-test/secrets/TEST_CLIENT_ID]
google_pubsub_topic.task_test_dag_test_task4: Refreshing state... [id=projects/serverless-etl-test/topics/task_test_dag_test_task4]
google_storage_bucket.bucket: Refreshing state... [id=stijnzanders-serverless-etl-bucket]
google_storage_bucket_object.task_test_task4: Refreshing state... [id=stijnzanders-serverless-etl-bucket-test_dag/test_task4_f522176be30b683fd152b0f2ad8deccf.zip]
google_cloud_scheduler_job.job_test_dag: Refreshing state... [id=projects/serverless-etl-test/locations/europe-west1/jobs/test_dag]
google_secret_manager_secret.TEST_CLIENT_SECRET: Refreshing state... [id=projects/serverless-etl-test/secrets/TEST_CLIENT_SECRET]
google_cloudfunctions_function.function_test_task: Refreshing state... [id=projects/serverless-etl-test/locations/europe-west1/functions/test_dag-test_task]
google_storage_bucket_object.task_test_task3: Refreshing state... [id=stijnzanders-serverless-etl-bucket-test_dag/test_task3_657543482d37eb77df97586b579e33e3.zip]
google_cloudfunctions_function.function_test_task3: Refreshing state... [id=projects/serverless-etl-test/locations/europe-west1/functions/test_dag-test_task3]
google_secret_manager_secret_version.TEST_CLIENT_ID-version: Refreshing state... [id=projects/697107834057/secrets/TEST_CLIENT_ID/versions/1]
google_pubsub_topic.dag_test_dag: Refreshing state... [id=projects/serverless-etl-test/topics/dag_test_dag]
google_storage_bucket_object.task_test_task: Refreshing state... [id=stijnzanders-serverless-etl-bucket-test_dag/test_task_482377fe4ed6d139223db356f3fb0c4a.zip]
google_pubsub_topic.task_test_dag_test_task2: Refreshing state... [id=projects/serverless-etl-test/topics/task_test_dag_test_task2]
google_cloudfunctions_function.function_test_task4: Refreshing state... [id=projects/serverless-etl-test/locations/europe-west1/functions/test_dag-test_task4]
google_pubsub_topic.task_test_dag_test_task: Refreshing state... [id=projects/serverless-etl-test/topics/task_test_dag_test_task]
google_pubsub_topic.task_test_dag_test_task3: Refreshing state... [id=projects/serverless-etl-test/topics/task_test_dag_test_task3]
google_secret_manager_secret_version.TEST_CLIENT_SECRET-version: Refreshing state... [id=projects/697107834057/secrets/TEST_CLIENT_SECRET/versions/1]
google_cloudfunctions_function.function_test_task2: Refreshing state... [id=projects/serverless-etl-test/locations/europe-west1/functions/test_dag-test_task2]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_cloud_scheduler_job.job_test_dag will be destroyed
  - resource "google_cloud_scheduler_job" "job_test_dag" {
      - description = "DAG that will for now just create a Google cloud scheduler" -> null
      - id          = "projects/serverless-etl-test/locations/europe-west1/jobs/test_dag" -> null
      - name        = "test_dag" -> null
      - project     = "serverless-etl-test" -> null
      - region      = "europe-west1" -> null
      - schedule    = "0 * * * *" -> null
      - time_zone   = "Etc/UTC" -> null

      - pubsub_target {
          - attributes = {} -> null
          - data       = "dGVzdA==" -> null
          - topic_name = "projects/serverless-etl-test/topics/dag_test_dag" -> null
        }
    }

  # google_cloud_scheduler_job.limber_jobtestdag_117F8DE7 will be created
  + resource "google_cloud_scheduler_job" "limber_jobtestdag_117F8DE7" {
      + description = "DAG that will for now just create a Google cloud scheduler"
      + id          = (known after apply)
      + name        = "test_dag"
      + project     = (known after apply)
      + region      = (known after apply)
      + schedule    = "0 * * * *"
      + time_zone   = "Etc/UTC"

      + pubsub_target {
          + data       = "dGVzdA=="
          + topic_name = (known after apply)
        }
    }

  # google_cloudfunctions_function.function_test_task will be destroyed
  - resource "google_cloudfunctions_function" "function_test_task" {
      - available_memory_mb   = 256 -> null
      - description           = "Test task" -> null
      - entry_point           = "cloudfunction_execution" -> null
      - environment_variables = {} -> null
      - id                    = "projects/serverless-etl-test/locations/europe-west1/functions/test_dag-test_task" -> null
      - ingress_settings      = "ALLOW_ALL" -> null
      - labels                = {} -> null
      - max_instances         = 0 -> null
      - name                  = "test_dag-test_task" -> null
      - project               = "serverless-etl-test" -> null
      - region                = "europe-west1" -> null
      - runtime               = "python37" -> null
      - service_account_email = "cloudfunctions@serverless-etl-test.iam.gserviceaccount.com" -> null
      - source_archive_bucket = "stijnzanders-serverless-etl-bucket" -> null
      - source_archive_object = "test_dag/test_task_482377fe4ed6d139223db356f3fb0c4a.zip" -> null
      - timeout               = 60 -> null

      - event_trigger {
          - event_type = "providers/cloud.pubsub/eventTypes/topic.publish" -> null
          - resource   = "projects/serverless-etl-test/topics/dag_test_dag" -> null

          - failure_policy {
              - retry = false -> null
            }
        }
    }

  # google_cloudfunctions_function.function_test_task2 will be destroyed
  - resource "google_cloudfunctions_function" "function_test_task2" {
      - available_memory_mb   = 128 -> null
      - description           = "Test task2" -> null
      - entry_point           = "cloudfunction_execution" -> null
      - environment_variables = {} -> null
      - id                    = "projects/serverless-etl-test/locations/europe-west1/functions/test_dag-test_task2" -> null
      - ingress_settings      = "ALLOW_ALL" -> null
      - labels                = {} -> null
      - max_instances         = 0 -> null
      - name                  = "test_dag-test_task2" -> null
      - project               = "serverless-etl-test" -> null
      - region                = "europe-west1" -> null
      - runtime               = "python37" -> null
      - service_account_email = "cloudfunctions@serverless-etl-test.iam.gserviceaccount.com" -> null
      - source_archive_bucket = "stijnzanders-serverless-etl-bucket" -> null
      - source_archive_object = "test_dag/test_task2_81fe29cfb4f6280c32e01022fa7a09aa.zip" -> null
      - timeout               = 60 -> null

      - event_trigger {
          - event_type = "providers/cloud.pubsub/eventTypes/topic.publish" -> null
          - resource   = "projects/serverless-etl-test/topics/task_test_dag_test_task" -> null

          - failure_policy {
              - retry = false -> null
            }
        }
    }

  # google_cloudfunctions_function.function_test_task3 will be destroyed
  - resource "google_cloudfunctions_function" "function_test_task3" {
      - available_memory_mb   = 256 -> null
      - description           = "Test task3" -> null
      - entry_point           = "cloudfunction_execution" -> null
      - environment_variables = {} -> null
      - id                    = "projects/serverless-etl-test/locations/europe-west1/functions/test_dag-test_task3" -> null
      - ingress_settings      = "ALLOW_ALL" -> null
      - labels                = {} -> null
      - max_instances         = 0 -> null
      - name                  = "test_dag-test_task3" -> null
      - project               = "serverless-etl-test" -> null
      - region                = "europe-west1" -> null
      - runtime               = "python37" -> null
      - service_account_email = "cloudfunctions@serverless-etl-test.iam.gserviceaccount.com" -> null
      - source_archive_bucket = "stijnzanders-serverless-etl-bucket" -> null
      - source_archive_object = "test_dag/test_task3_657543482d37eb77df97586b579e33e3.zip" -> null
      - timeout               = 60 -> null

      - event_trigger {
          - event_type = "providers/cloud.pubsub/eventTypes/topic.publish" -> null
          - resource   = "projects/serverless-etl-test/topics/task_test_dag_test_task2" -> null

          - failure_policy {
              - retry = false -> null
            }
        }
    }

  # google_cloudfunctions_function.function_test_task4 will be destroyed
  - resource "google_cloudfunctions_function" "function_test_task4" {
      - available_memory_mb   = 256 -> null
      - description           = "Throttled task" -> null
      - entry_point           = "cloudfunction_execution" -> null
      - environment_variables = {} -> null
      - https_trigger_url     = "https://europe-west1-serverless-etl-test.cloudfunctions.net/test_dag-test_task4" -> null
      - id                    = "projects/serverless-etl-test/locations/europe-west1/functions/test_dag-test_task4" -> null
      - ingress_settings      = "ALLOW_INTERNAL_ONLY" -> null
      - labels                = {} -> null
      - max_instances         = 0 -> null
      - name                  = "test_dag-test_task4" -> null
      - project               = "serverless-etl-test" -> null
      - region                = "europe-west1" -> null
      - runtime               = "python37" -> null
      - service_account_email = "cloudfunctions@serverless-etl-test.iam.gserviceaccount.com" -> null
      - source_archive_bucket = "stijnzanders-serverless-etl-bucket" -> null
      - source_archive_object = "test_dag/test_task4_f522176be30b683fd152b0f2ad8deccf.zip" -> null
      - timeout               = 60 -> null
      - trigger_http          = true -> null
    }

  # google_cloudfunctions_function.limber_functiontesttask2_8DD95C39 will be created
  + resource "google_cloudfunctions_function" "limber_functiontesttask2_8DD95C39" {
      + available_memory_mb           = 128
      + description                   = "Test task2"
      + entry_point                   = "cloudfunction_execution"
      + https_trigger_url             = (known after apply)
      + id                            = (known after apply)
      + ingress_settings              = "ALLOW_ALL"
      + max_instances                 = 0
      + name                          = "test_dag-test_task2"
      + project                       = (known after apply)
      + region                        = (known after apply)
      + runtime                       = "python37"
      + service_account_email         = "cloudfunctions@serverless-etl-test.iam.gserviceaccount.com"
      + source_archive_bucket         = "stijnzanders-serverless-etl-bucket"
      + source_archive_object         = "test_dag/test_task2_04eed3106bd97d86dfa636dda21a2c89.zip"
      + timeout                       = 60
      + vpc_connector_egress_settings = (known after apply)

      + event_trigger {
          + event_type = "providers/cloud.pubsub/eventTypes/topic.publish"
          + resource   = "task_test_dag_test_task"

          + failure_policy {
              + retry = (known after apply)
            }
        }
    }

  # google_cloudfunctions_function.limber_functiontesttask3_88EB0178 will be created
  + resource "google_cloudfunctions_function" "limber_functiontesttask3_88EB0178" {
      + available_memory_mb           = 256
      + description                   = "Test task3"
      + entry_point                   = "cloudfunction_execution"
      + https_trigger_url             = (known after apply)
      + id                            = (known after apply)
      + ingress_settings              = "ALLOW_ALL"
      + max_instances                 = 0
      + name                          = "test_dag-test_task3"
      + project                       = (known after apply)
      + region                        = (known after apply)
      + runtime                       = "python37"
      + service_account_email         = "cloudfunctions@serverless-etl-test.iam.gserviceaccount.com"
      + source_archive_bucket         = "stijnzanders-serverless-etl-bucket"
      + source_archive_object         = "test_dag/test_task3_d1a2ed60340d8801c252210242ff98aa.zip"
      + timeout                       = 120
      + vpc_connector_egress_settings = (known after apply)

      + event_trigger {
          + event_type = "providers/cloud.pubsub/eventTypes/topic.publish"
          + resource   = "task_test_dag_test_task2"

          + failure_policy {
              + retry = (known after apply)
            }
        }
    }

  # google_cloudfunctions_function.limber_functiontesttask_771DBEC7 will be created
  + resource "google_cloudfunctions_function" "limber_functiontesttask_771DBEC7" {
      + available_memory_mb           = 256
      + description                   = "Test task"
      + entry_point                   = "cloudfunction_execution"
      + https_trigger_url             = (known after apply)
      + id                            = (known after apply)
      + ingress_settings              = "ALLOW_ALL"
      + max_instances                 = 0
      + name                          = "test_dag-test_task"
      + project                       = (known after apply)
      + region                        = (known after apply)
      + runtime                       = "python37"
      + service_account_email         = "cloudfunctions@serverless-etl-test.iam.gserviceaccount.com"
      + source_archive_bucket         = "stijnzanders-serverless-etl-bucket"
      + source_archive_object         = "test_dag/test_task_c58cd591126e53386d960f5b39e8af3a.zip"
      + timeout                       = 60
      + vpc_connector_egress_settings = (known after apply)

      + event_trigger {
          + event_type = "providers/cloud.pubsub/eventTypes/topic.publish"
          + resource   = "dag_test_dag"

          + failure_policy {
              + retry = (known after apply)
            }
        }
    }

  # google_pubsub_topic.dag_test_dag will be destroyed
  - resource "google_pubsub_topic" "dag_test_dag" {
      - id      = "projects/serverless-etl-test/topics/dag_test_dag" -> null
      - labels  = {} -> null
      - name    = "dag_test_dag" -> null
      - project = "serverless-etl-test" -> null
    }

  # google_pubsub_topic.limber_dagtestdag_B0E364DA will be created
  + resource "google_pubsub_topic" "limber_dagtestdag_B0E364DA" {
      + id      = (known after apply)
      + name    = "dag_test_dag"
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # google_pubsub_topic.limber_tasktestdagtesttask2_EF4548CB will be created
  + resource "google_pubsub_topic" "limber_tasktestdagtesttask2_EF4548CB" {
      + id      = (known after apply)
      + name    = "task_test_dag_test_task2"
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # google_pubsub_topic.limber_tasktestdagtesttask3_22CA0553 will be created
  + resource "google_pubsub_topic" "limber_tasktestdagtesttask3_22CA0553" {
      + id      = (known after apply)
      + name    = "task_test_dag_test_task3"
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # google_pubsub_topic.limber_tasktestdagtesttask_92188BC5 will be created
  + resource "google_pubsub_topic" "limber_tasktestdagtesttask_92188BC5" {
      + id      = (known after apply)
      + name    = "task_test_dag_test_task"
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # google_pubsub_topic.task_test_dag_test_task will be destroyed
  - resource "google_pubsub_topic" "task_test_dag_test_task" {
      - id      = "projects/serverless-etl-test/topics/task_test_dag_test_task" -> null
      - labels  = {} -> null
      - name    = "task_test_dag_test_task" -> null
      - project = "serverless-etl-test" -> null
    }

  # google_pubsub_topic.task_test_dag_test_task2 will be destroyed
  - resource "google_pubsub_topic" "task_test_dag_test_task2" {
      - id      = "projects/serverless-etl-test/topics/task_test_dag_test_task2" -> null
      - labels  = {} -> null
      - name    = "task_test_dag_test_task2" -> null
      - project = "serverless-etl-test" -> null
    }

  # google_pubsub_topic.task_test_dag_test_task3 will be destroyed
  - resource "google_pubsub_topic" "task_test_dag_test_task3" {
      - id      = "projects/serverless-etl-test/topics/task_test_dag_test_task3" -> null
      - labels  = {} -> null
      - name    = "task_test_dag_test_task3" -> null
      - project = "serverless-etl-test" -> null
    }

  # google_pubsub_topic.task_test_dag_test_task4 will be destroyed
  - resource "google_pubsub_topic" "task_test_dag_test_task4" {
      - id      = "projects/serverless-etl-test/topics/task_test_dag_test_task4" -> null
      - labels  = {} -> null
      - name    = "task_test_dag_test_task4" -> null
      - project = "serverless-etl-test" -> null
    }

  # google_secret_manager_secret.TEST_CLIENT_ID will be destroyed
  - resource "google_secret_manager_secret" "TEST_CLIENT_ID" {
      - create_time = "2021-01-20T06:58:21.465843Z" -> null
      - id          = "projects/serverless-etl-test/secrets/TEST_CLIENT_ID" -> null
      - labels      = {} -> null
      - name        = "projects/697107834057/secrets/TEST_CLIENT_ID" -> null
      - project     = "serverless-etl-test" -> null
      - secret_id   = "TEST_CLIENT_ID" -> null

      - replication {
          - automatic = true -> null
        }
    }

  # google_secret_manager_secret.TEST_CLIENT_SECRET will be destroyed
  - resource "google_secret_manager_secret" "TEST_CLIENT_SECRET" {
      - create_time = "2021-01-20T06:58:21.569303Z" -> null
      - id          = "projects/serverless-etl-test/secrets/TEST_CLIENT_SECRET" -> null
      - labels      = {} -> null
      - name        = "projects/697107834057/secrets/TEST_CLIENT_SECRET" -> null
      - project     = "serverless-etl-test" -> null
      - secret_id   = "TEST_CLIENT_SECRET" -> null

      - replication {
          - automatic = true -> null
        }
    }

  # google_secret_manager_secret_version.TEST_CLIENT_ID-version will be destroyed
  - resource "google_secret_manager_secret_version" "TEST_CLIENT_ID-version" {
      - create_time = "2021-01-20T06:58:22.117603Z" -> null
      - enabled     = true -> null
      - id          = "projects/697107834057/secrets/TEST_CLIENT_ID/versions/1" -> null
      - name        = "projects/697107834057/secrets/TEST_CLIENT_ID/versions/1" -> null
      - secret      = "projects/serverless-etl-test/secrets/TEST_CLIENT_ID" -> null
      - secret_data = (sensitive value)
    }

  # google_secret_manager_secret_version.TEST_CLIENT_SECRET-version will be destroyed
  - resource "google_secret_manager_secret_version" "TEST_CLIENT_SECRET-version" {
      - create_time = "2021-01-20T06:58:22.319538Z" -> null
      - enabled     = true -> null
      - id          = "projects/697107834057/secrets/TEST_CLIENT_SECRET/versions/1" -> null
      - name        = "projects/697107834057/secrets/TEST_CLIENT_SECRET/versions/1" -> null
      - secret      = "projects/serverless-etl-test/secrets/TEST_CLIENT_SECRET" -> null
      - secret_data = (sensitive value)
    }

  # google_storage_bucket.bucket will be destroyed
  - resource "google_storage_bucket" "bucket" {
      - bucket_policy_only          = false -> null
      - default_event_based_hold    = false -> null
      - force_destroy               = false -> null
      - id                          = "stijnzanders-serverless-etl-bucket" -> null
      - labels                      = {} -> null
      - location                    = "EU" -> null
      - name                        = "stijnzanders-serverless-etl-bucket" -> null
      - project                     = "serverless-etl-test" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/stijnzanders-serverless-etl-bucket" -> null
      - storage_class               = "STANDARD" -> null
      - uniform_bucket_level_access = false -> null
      - url                         = "gs://stijnzanders-serverless-etl-bucket" -> null
    }

  # google_storage_bucket.limber_cloudstoragebucket_AB7CB639 will be created
  + resource "google_storage_bucket" "limber_cloudstoragebucket_AB7CB639" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "stijnzanders-serverless-etl-bucket"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # google_storage_bucket_object.limber_tasktesttask2_0DB0815E will be created
  + resource "google_storage_bucket_object" "limber_tasktesttask2_0DB0815E" {
      + bucket         = "stijnzanders-serverless-etl-bucket"
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "test_dag/test_task2_04eed3106bd97d86dfa636dda21a2c89.zip"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "test_dag/test_task2.zip"
      + storage_class  = (known after apply)
    }

  # google_storage_bucket_object.limber_tasktesttask3_471E7750 will be created
  + resource "google_storage_bucket_object" "limber_tasktesttask3_471E7750" {
      + bucket         = "stijnzanders-serverless-etl-bucket"
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "test_dag/test_task3_d1a2ed60340d8801c252210242ff98aa.zip"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "test_dag/test_task3.zip"
      + storage_class  = (known after apply)
    }

  # google_storage_bucket_object.limber_tasktesttask_191E579E will be created
  + resource "google_storage_bucket_object" "limber_tasktesttask_191E579E" {
      + bucket         = "stijnzanders-serverless-etl-bucket"
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "test_dag/test_task_c58cd591126e53386d960f5b39e8af3a.zip"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "test_dag/test_task.zip"
      + storage_class  = (known after apply)
    }

  # google_storage_bucket_object.task_test_task will be destroyed
  - resource "google_storage_bucket_object" "task_test_task" {
      - bucket           = "stijnzanders-serverless-etl-bucket" -> null
      - content_type     = "application/zip" -> null
      - crc32c           = "H9JR3Q==" -> null
      - detect_md5hash   = "SCN3/k7W0TkiPbNW8/sMSg==" -> null
      - event_based_hold = false -> null
      - id               = "stijnzanders-serverless-etl-bucket-test_dag/test_task_482377fe4ed6d139223db356f3fb0c4a.zip" -> null
      - md5hash          = "SCN3/k7W0TkiPbNW8/sMSg==" -> null
      - media_link       = "https://storage.googleapis.com/download/storage/v1/b/stijnzanders-serverless-etl-bucket/o/test_dag%2Ftest_task_482377fe4ed6d139223db356f3fb0c4a.zip?generation=1611126476647208&alt=media" -> null
      - metadata         = {} -> null
      - name             = "test_dag/test_task_482377fe4ed6d139223db356f3fb0c4a.zip" -> null
      - output_name      = "test_dag/test_task_482377fe4ed6d139223db356f3fb0c4a.zip" -> null
      - self_link        = "https://www.googleapis.com/storage/v1/b/stijnzanders-serverless-etl-bucket/o/test_dag%2Ftest_task_482377fe4ed6d139223db356f3fb0c4a.zip" -> null
      - source           = "test_dag/test_task.zip" -> null
      - storage_class    = "STANDARD" -> null
      - temporary_hold   = false -> null
    }

  # google_storage_bucket_object.task_test_task2 will be destroyed
  - resource "google_storage_bucket_object" "task_test_task2" {
      - bucket           = "stijnzanders-serverless-etl-bucket" -> null
      - content_type     = "application/zip" -> null
      - crc32c           = "Hkj3fg==" -> null
      - detect_md5hash   = "gf4pz7T2KAwy4BAi+noJqg==" -> null
      - event_based_hold = false -> null
      - id               = "stijnzanders-serverless-etl-bucket-test_dag/test_task2_81fe29cfb4f6280c32e01022fa7a09aa.zip" -> null
      - md5hash          = "gf4pz7T2KAwy4BAi+noJqg==" -> null
      - media_link       = "https://storage.googleapis.com/download/storage/v1/b/stijnzanders-serverless-etl-bucket/o/test_dag%2Ftest_task2_81fe29cfb4f6280c32e01022fa7a09aa.zip?generation=1611126476660868&alt=media" -> null
      - metadata         = {} -> null
      - name             = "test_dag/test_task2_81fe29cfb4f6280c32e01022fa7a09aa.zip" -> null
      - output_name      = "test_dag/test_task2_81fe29cfb4f6280c32e01022fa7a09aa.zip" -> null
      - self_link        = "https://www.googleapis.com/storage/v1/b/stijnzanders-serverless-etl-bucket/o/test_dag%2Ftest_task2_81fe29cfb4f6280c32e01022fa7a09aa.zip" -> null
      - source           = "test_dag/test_task2.zip" -> null
      - storage_class    = "STANDARD" -> null
      - temporary_hold   = false -> null
    }

  # google_storage_bucket_object.task_test_task3 will be destroyed
  - resource "google_storage_bucket_object" "task_test_task3" {
      - bucket           = "stijnzanders-serverless-etl-bucket" -> null
      - content_type     = "application/zip" -> null
      - crc32c           = "5OD/Hw==" -> null
      - detect_md5hash   = "ZXVDSC0363ffl1hrV54z4w==" -> null
      - event_based_hold = false -> null
      - id               = "stijnzanders-serverless-etl-bucket-test_dag/test_task3_657543482d37eb77df97586b579e33e3.zip" -> null
      - md5hash          = "ZXVDSC0363ffl1hrV54z4w==" -> null
      - media_link       = "https://storage.googleapis.com/download/storage/v1/b/stijnzanders-serverless-etl-bucket/o/test_dag%2Ftest_task3_657543482d37eb77df97586b579e33e3.zip?generation=1611126476688416&alt=media" -> null
      - metadata         = {} -> null
      - name             = "test_dag/test_task3_657543482d37eb77df97586b579e33e3.zip" -> null
      - output_name      = "test_dag/test_task3_657543482d37eb77df97586b579e33e3.zip" -> null
      - self_link        = "https://www.googleapis.com/storage/v1/b/stijnzanders-serverless-etl-bucket/o/test_dag%2Ftest_task3_657543482d37eb77df97586b579e33e3.zip" -> null
      - source           = "test_dag/test_task3.zip" -> null
      - storage_class    = "STANDARD" -> null
      - temporary_hold   = false -> null
    }

  # google_storage_bucket_object.task_test_task4 will be destroyed
  - resource "google_storage_bucket_object" "task_test_task4" {
      - bucket           = "stijnzanders-serverless-etl-bucket" -> null
      - content_type     = "application/zip" -> null
      - crc32c           = "YeI8MQ==" -> null
      - detect_md5hash   = "9SIXa+MLaD/RUrDyrY3szw==" -> null
      - event_based_hold = false -> null
      - id               = "stijnzanders-serverless-etl-bucket-test_dag/test_task4_f522176be30b683fd152b0f2ad8deccf.zip" -> null
      - md5hash          = "9SIXa+MLaD/RUrDyrY3szw==" -> null
      - media_link       = "https://storage.googleapis.com/download/storage/v1/b/stijnzanders-serverless-etl-bucket/o/test_dag%2Ftest_task4_f522176be30b683fd152b0f2ad8deccf.zip?generation=1611126476641957&alt=media" -> null
      - metadata         = {} -> null
      - name             = "test_dag/test_task4_f522176be30b683fd152b0f2ad8deccf.zip" -> null
      - output_name      = "test_dag/test_task4_f522176be30b683fd152b0f2ad8deccf.zip" -> null
      - self_link        = "https://www.googleapis.com/storage/v1/b/stijnzanders-serverless-etl-bucket/o/test_dag%2Ftest_task4_f522176be30b683fd152b0f2ad8deccf.zip" -> null
      - source           = "test_dag/test_task4.zip" -> null
      - storage_class    = "STANDARD" -> null
      - temporary_hold   = false -> null
    }

Plan: 12 to add, 0 to change, 19 to destroy.

```

</details>

*Pusher: @StijnZanders, Action: `pull_request`*